Revit 2023 API
Connector.EngagementLength Property
 Connector engagement length
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Syntax
C#
public double EngagementLength { get; }
Visual Basic
Public ReadOnly Property EngagementLength As Double
	Get
Visual C++
public:
property double EngagementLength {
	double get ();
}
See Also
Connector Class
Autodesk.Revit.DB Namespace